; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite4 - satellite
	instrument11 - instrument
	image1 - mode
	image2 - mode
	infrared3 - mode
	spectrograph4 - mode
	thermograph0 - mode
	GroundStation6 - direction
	GroundStation3 - direction
	Star1 - direction
	Star5 - direction
	Star2 - direction
	Star4 - direction
	GroundStation0 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star5)
	(supports instrument1 image1)
	(supports instrument1 spectrograph4)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 image2)
	(supports instrument2 image1)
	(supports instrument2 infrared3)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument3 spectrograph4)
	(calibration_target instrument3 Star2)
	(supports instrument4 spectrograph4)
	(supports instrument4 image2)
	(calibration_target instrument4 Star4)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 spectrograph4)
	(calibration_target instrument5 Star2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon9)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 Star5)
	(supports instrument7 image2)
	(calibration_target instrument7 Star4)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon7)
	(supports instrument8 spectrograph4)
	(calibration_target instrument8 Star1)
	(supports instrument9 image2)
	(supports instrument9 thermograph0)
	(supports instrument9 spectrograph4)
	(calibration_target instrument9 Star2)
	(calibration_target instrument9 Star5)
	(supports instrument10 thermograph0)
	(supports instrument10 spectrograph4)
	(calibration_target instrument10 Star4)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star1)
	(supports instrument11 image1)
	(supports instrument11 infrared3)
	(calibration_target instrument11 GroundStation0)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star10)
)
(:goal (and
	(pointing satellite1 GroundStation3)
	(pointing satellite4 Star4)
	(have_image Phenomenon7 image2)
	(have_image Star8 spectrograph4)
	(have_image Phenomenon9 spectrograph4)
	(have_image Star10 image1)
	(have_image Planet11 image2)
))

)

; plan
1. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 0 of 7
2. (calibrate satellite3 instrument8 star1)
   added: (calibrated instrument8)
   goals met: 0 of 7
3. (turn_to satellite3 star8 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 star8)
   goals met: 0 of 7
4. (take_image satellite3 star8 instrument8 spectrograph4)
   added: (have_image star8 spectrograph4)
   goals met: 1 of 7
5. (turn_to satellite3 phenomenon9 star8)
   deleted: (pointing satellite3 star8)
   added: (pointing satellite3 phenomenon9)
   goals met: 1 of 7
6. (turn_to satellite1 groundstation3 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 groundstation3)
   goals met: 2 of 7
7. (turn_to satellite0 groundstation3 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 groundstation3)
   goals met: 2 of 7
8. (take_image satellite3 phenomenon9 instrument8 spectrograph4)
   added: (have_image phenomenon9 spectrograph4)
   goals met: 3 of 7
9. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 3 of 7
10. (calibrate satellite0 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 3 of 7
11. (turn_to satellite0 phenomenon7 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon7)
   goals met: 3 of 7
12. (take_image satellite0 phenomenon7 instrument2 image2)
   added: (have_image phenomenon7 image2)
   goals met: 4 of 7
13. (turn_to satellite0 planet11 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet11)
   goals met: 4 of 7
14. (take_image satellite0 planet11 instrument2 image2)
   added: (have_image planet11 image2)
   goals met: 5 of 7
15. (turn_to satellite0 star10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star10)
   goals met: 5 of 7
16. (take_image satellite0 star10 instrument2 image1)
   added: (have_image star10 image1)
   goals met: 6 of 7
17. (turn_to satellite4 star4 star10)
   deleted: (pointing satellite4 star10)
   added: (pointing satellite4 star4)
   goals met: 7 of 7
